IDEA StatiCa Open Model
TypeOfSupportConditions Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Define type of support conditions
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum TypeOfSupportConditions
Public Enumeration TypeOfSupportConditions
public enum class TypeOfSupportConditions
Members
Member name | Value | Description
NonContinuous | 0 |  Non-continuous members
Continuous | 1 |  Continuous members
FullyRestrained | 2 |  Supports considered fully restrained
Bearing | 3 |  Bearing provided
Cantilever | 4 |  Cantilever
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace